github_data_collector/src/data/issue_comment/the-benchmarker_web-frameworks.txt
Updates the requirements on [fastapi](https://github.com/tiangolo/fastapi) to permit the latest version.
<details>
<summary>Release notes</summary>
<p><em>Sourced from <a href="https://github.com/tiangolo/fastapi/releases">fastapi's releases</a>.</em></p>
<blockquote>
<h2>0.47.1</h2>
<ul>
<li>Fix model filtering in <code>response_model</code>, cloning sub-models. PR <a href="https://github-redirect.dependabot.com/tiangolo/fastapi/pull/889">#889</a>.</li>
<li>Fix FastAPI serialization of Pydantic models using ORM mode blocking the event loop. PR <a href="https://github-redirect.dependabot.com/tiangolo/fastapi/pull/888">#888</a>.</li>
</ul>
</blockquote>
</details>
<details>
<summary>Commits</summary>
<ul>
<li><a href="https://github.com/tiangolo/fastapi/commit/a0858983096cad68c1de7d67085b547354990791"><code>a085898</code></a> :bookmark: Release version 0.47.1</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/3b40c557ce65843e68889b6c43b302e8707ad659"><code>3b40c55</code></a> :memo: Update release notes</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/75a07f24bf01a31225ee687f3e2b3fc1981b67ab"><code>75a07f2</code></a> :lock: Fix clone field implementation to handle sub-models in response_model ...</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/7cea84b74ca3106a7f861b774e9d215e5228728f"><code>7cea84b</code></a> :bug: Fix FastAPI serialization of Pydantic ORM mode blocking the event loop ...</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/3a5158a784d7baaf370dff700913ab559e361213"><code>3a5158a</code></a> :bookmark: Release version 0.47.0</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/bd581c5337dfb33b6670f84dddb7ab4f2139b123"><code>bd581c5</code></a> :memo: Update release notes</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/22982287ff5e8434fdaffcf118d56eb084f2490c"><code>2298228</code></a> :memo: Refactor docs, &quot;Tutorial - User Guide&quot; and &quot;Advanced User Guide&quot; (<a href="https://github-redirect.dependabot.com/tiangolo/fastapi/issues/887">#887</a>)</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/a41a7296826a32bf03819bbc6149a3037a3da0bb"><code>a41a729</code></a> :art: Tweak external links, Markdown format, typos (<a href="https://github-redirect.dependabot.com/tiangolo/fastapi/issues/881">#881</a>)</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/174e7b1730c6b21eb015a8b8ff3e56e018bc0de3"><code>174e7b1</code></a> :lock: Check both username and password in security tutorial (<a href="https://github-redirect.dependabot.com/tiangolo/fastapi/issues/865">#865</a>)</li>
<li><a href="https://github.com/tiangolo/fastapi/commit/874d24181e779ebc6e1c52afb7d6598f863fd6a8"><code>874d241</code></a> :bug: Fix validating form params declared with classes (list, tuple, set, etc...</li>
<li>Additional commits viewable in <a href="https://github.com/tiangolo/fastapi/compare/0.46.0...0.47.1">compare view</a></li>
</ul>
</details>
<br />


You can trigger a rebase of this PR by commenting `@dependabot rebase`.

[//]: # (dependabot-automerge-start)
[//]: # (dependabot-automerge-end)

---

<details>
<summary>Dependabot commands and options</summary>
<br />

You can trigger Dependabot actions by commenting on this PR:
- `@dependabot rebase` will rebase this PR
- `@dependabot recreate` will recreate this PR, overwriting any edits that have been made to it
- `@dependabot merge` will merge this PR after your CI passes on it
- `@dependabot squash and merge` will squash and merge this PR after your CI passes on it
- `@dependabot cancel merge` will cancel a previously requested merge and block automerging
- `@dependabot reopen` will reopen this PR if it is closed
- `@dependabot close` will close this PR and stop Dependabot recreating it. You can achieve the same result by closing it manually
- `@dependabot ignore this major version` will close this PR and stop Dependabot creating any more for this major version (unless you reopen the PR or upgrade to it yourself)
- `@dependabot ignore this minor version` will close this PR and stop Dependabot creating any more for this minor version (unless you reopen the PR or upgrade to it yourself)
- `@dependabot ignore this dependency` will close this PR and stop Dependabot creating any more for this dependency (unless you reopen the PR or upgrade to it yourself)
- `@dependabot badge me` will comment on this PR with code to add a "Dependabot enabled" badge to your readme

Additionally, you can set the following in the `.dependabot/config.yml` file in this repo:
- Update frequency
- Automerge options (never/patch/minor, and dev/runtime dependencies)
- Out-of-range updates (receive only lockfile updates, if desired)
- Security updates (receive only security updates, if desired)



</details>
Dependabot couldn't find a package.json for this project.

Dependabot requires a package.json to evaluate your project's current JavaScript dependencies. It had expected to find one at the path: `/javascript/nanoexpress-pro/package.json`.

If this isn't a JavaScript project, or if it is a library, you may wish to disable updates for it in the `.dependabot/config.yml` file in this repo.

[View the update logs](https://app.dependabot.com/accounts/the-benchmarker/update-logs/20799125).
Bumps [github.com/gogf/gf](https://github.com/gogf/gf) from 1.11.2 to 1.11.3.
<details>
<summary>Commits</summary>
<ul>
<li><a href="https://github.com/gogf/gf/commit/c07c4d72179c6003d48c25dfc502588ec5dfd6e9"><code>c07c4d7</code></a> version updates</li>
<li><a href="https://github.com/gogf/gf/commit/b867b2a0bce6bc584927241c9c4144e2b7bbb68b"><code>b867b2a</code></a> add return parameter name for function Cas of gtype;improve Response.Redirect...</li>
<li><a href="https://github.com/gogf/gf/commit/872d6741825f251425518537bae833d380fbdc1e"><code>872d674</code></a> fix issue in database 'time' type support in package gdb</li>
<li><a href="https://github.com/gogf/gf/commit/4682abafdf9579ed0c60ad224c566852191bea34"><code>4682aba</code></a> fix concurrent issue in gdb.Model.Count</li>
<li><a href="https://github.com/gogf/gf/commit/b7d194cf52ae660d335b474f19c861ddb68686a2"><code>b7d194c</code></a> improva gcmd.Parser/gres</li>
<li><a href="https://github.com/gogf/gf/commit/edf236629686a14aa12205b4e1b79400f51df9a6"><code>edf2366</code></a> improve gzip feature for gcompress; add gzip compression for package gres</li>
<li><a href="https://github.com/gogf/gf/commit/22af5be71f2308c9411f64ef7173e44f0dcbf808"><code>22af5be</code></a> rename parameter name for gipv4.Ip2Long/Long2Ip</li>
<li><a href="https://github.com/gogf/gf/commit/f662ff8051b9de01590b6f1e63499287f420c4c4"><code>f662ff8</code></a> add pprof unit testing case for ghttp; reame updates</li>
<li>See full diff in <a href="https://github.com/gogf/gf/compare/v1.11.2...v1.11.3">compare view</a></li>
</ul>
</details>
<br />


[![Dependabot compatibility score](https://api.dependabot.com/badges/compatibility_score?dependency-name=github.com/gogf/gf&package-manager=go_modules&previous-version=1.11.2&new-version=1.11.3)](https://dependabot.com/compatibility-score.html?dependency-name=github.com/gogf/gf&package-manager=go_modules&previous-version=1.11.2&new-version=1.11.3)

You can trigger a rebase of this PR by commenting `@dependabot rebase`.

[//]: # (dependabot-automerge-start)
[//]: # (dependabot-automerge-end)

---

<details>
<summary>Dependabot commands and options</summary>
<br />

You can trigger Dependabot actions by commenting on this PR:
- `@dependabot rebase` will rebase this PR
- `@dependabot recreate` will recreate this PR, overwriting any edits that have been made to it
- `@dependabot merge` will merge this PR after your CI passes on it
- `@dependabot squash and merge` will squash and merge this PR after your CI passes on it
- `@dependabot cancel merge` will cancel a previously requested merge and block automerging
- `@dependabot reopen` will reopen this PR if it is closed
- `@dependabot close` will close this PR and stop Dependabot recreating it. You can achieve the same result by closing it manually
- `@dependabot ignore this major version` will close this PR and stop Dependabot creating any more for this major version (unless you reopen the PR or upgrade to it yourself)
- `@dependabot ignore this minor version` will close this PR and stop Dependabot creating any more for this minor version (unless you reopen the PR or upgrade to it yourself)
- `@dependabot ignore this dependency` will close this PR and stop Dependabot creating any more for this dependency (unless you reopen the PR or upgrade to it yourself)
- `@dependabot badge me` will comment on this PR with code to add a "Dependabot enabled" badge to your readme

Additionally, you can set the following in the `.dependabot/config.yml` file in this repo:
- Update frequency
- Automerge options (never/patch/minor, and dev/runtime dependencies)
- Out-of-range updates (receive only lockfile updates, if desired)
- Security updates (receive only security updates, if desired)



</details>
Hi @boazsegev,

I have some strange results for `plezi`.

I'm using `wrk` to get statistical results, `req/s` ... and I have :

+ `wrk -H 'Connection: keep-alive' --latency -d 15s -c 1000 --timeout 8 -t 16 http://172.17.0.4:3000/`
```
Running 15s test @ http://172.17.0.4:3000/
  16 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   164.09ms  227.79ms   1.47s    83.53%
    Req/Sec   232.27    558.20     4.25k    92.19%
  Latency Distribution
     50%   24.55ms
     75%  276.82ms
     90%  516.83ms
     99%  894.23ms
  28164 requests in 15.09s, 0.00B read
  Socket errors: connect 992, read 28164, write 0, timeout 0
Requests/sec:   1866.45
Transfer/sec:       0.00B
```
+ `wrk -H 'Connection: keep-alive' --latency -d 15s -c 1000 --timeout 8 -t 16 http://172.17.0.4:3000/user/0`
```
Running 15s test @ http://172.17.0.4:3000/user/0
  16 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.18ms    4.53ms  69.00ms   73.04%
    Req/Sec     4.04k   464.17    12.90k    86.09%
  Latency Distribution
     50%   13.99ms
     75%   17.52ms
     90%   21.70ms
     99%   28.86ms
  965903 requests in 15.09s, 130.80MB read
Requests/sec:  64014.21
Transfer/sec:      8.67MB
```
+ `wrk -H 'Connection: keep-alive' --latency -d 15s -c 1000 --timeout 8 -t 16 http://172.17.0.4:3000/user` (**POST** via `lua`)
```
Running 15s test @ http://172.17.0.4:3000/user
  16 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.58ms   74.17ms 240.63ms   56.25%
    Req/Sec    26.20     17.39    56.00     80.00%
  Latency Distribution
     50%   60.07ms
     75%  150.47ms
     90%  191.63ms
     99%  240.63ms
  64 requests in 15.09s, 0.00B read
  Socket errors: connect 992, read 64, write 0, timeout 0
Requests/sec:      4.24
Transfer/sec:       0.00B
```

Regards,


:warning: I'm on the same machine, perhaps it's a problem



Hi @Fenny,

You inform me that the is some stories about `uWebSocket` 
@see https://medium.com/@rockstudillo/beware-of-uwebsockets-js-b51c92cac83f 

Thanks for notification :stuck_out_tongue: 

/cc @alexhultman @dalisoft @aadityataparia @jkyberneees 

---------------

The idea `here` is to determine if `uWebSocket` based frameworks could be listed `here`

---------------

Personally, I have no idea of how `npm` **registry** works